/*+-------------------------------------------------------------------+*/
/*|                                                                   |*/
/*| PROGRAM NAME: sdh_wsp_test                                        |*/
/*| -------------                                                     |*/
/*|  DLL / Library for WebSecureProxy v3                              |*/
/*|    Server-Data-Hook                                               |*/
/*|  Test SDH                                                         |*/
/*|    Tests callback function of WSP                                 |*/
/*|  TJ 23.09.09                                                      |*/
/*|                                                                   |*/
/*| COPYRIGHT:                                                        |*/
/*| ----------                                                        |*/
/*|  Copyright (C) HOB 2009                                           |*/
/*|  Copyright (C) HOB Germany 2009                                   |*/
/*|                                                                   |*/
/*| REQUIRED PROGRAMS:                                                |*/
/*| ------------------                                                |*/
/*|  MS Visual Studio 2005 (VC8)                                      |*/
/*|                                                                   |*/
/*| FUNCTION:                                                         |*/

    unsigned long long ull_addr;
    int im_size;
    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_mem_write(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[0]!=8)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_mem_write(): Invalid parameter size (0): %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }
    if ((ads_cmd->imr_parlen[1]<1)||(ads_cmd->imr_parlen[1]>MAX_CMD_PARAM_LEN))
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_mem_write(): Invalid parameter size: %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    ull_addr=m_getpar_uint64(ads_cmd,0);
    im_size=ads_cmd->imr_parlen[1];

    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_MEM_WRITE addr=0x%016llx, size=%d\r\n",ull_addr,im_size);
    }
    memcpy((void*)ull_addr,&ads_cmd->chrr_par[1][0],(size_t)im_size);
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=0;
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_mem_free(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    void *auaddr=NULL;
    unsigned long long ull_addr;
    int im_size;
    bool bo_ret;

    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_mem_free(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[0]!=8)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_mem_free(): Invalid parameter size (0): %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[1]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_mem_free(): Invalid parameter size (1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    ull_addr=m_getpar_uint64(ads_cmd,0);
    im_size=(int)m_getpar_uint32(ads_cmd,1);
    auaddr=(void *)ull_addr;

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_MEMFREE,
                                &auaddr,
                                im_size);
    if (bo_ret==false)
    {
        PRINT_DIRECT("DEF_AUX_MEMFREE failed! ret=false");
        return;
    }
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_MEM_FREE addr=0x%016llx, size=%d, ret=%d\r\n",ull_addr,im_size,(bo_ret&0x01));
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_cma_query(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_hl_aux_c_cma_1 ds_cma;
    bool bo_ret;
    //char ch_enc;

    memset(&ds_cma,0,sizeof(ds_cma));
    

    if(ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_query(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    if (ads_cmd->imr_parlen[1]!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_query(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
    ds_cma.iec_chs_name=(ied_charset)m_getpar_byte(ads_cmd,1);
    ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
    if (ds_cma.iec_chs_name>3)ds_cma.inc_len_cma_name=ds_cma.inc_len_cma_name/2; //UTF-16
    if (ds_cma.iec_chs_name>6)ds_cma.inc_len_cma_name=ds_cma.inc_len_cma_name/2; //UTF-32
    ds_cma.iec_ccma_def=ied_ccma_query;
    ds_cma.inc_len_cma_area=-1;
        
    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_QUERY size=%d, ret=%d\r\n",ds_cma.inc_len_cma_area,(bo_ret&0x01));
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_setpar_uint32(ads_cmd,1,(unsigned)ds_cma.inc_len_cma_area);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_cma_setsize(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
	struct dsd_hl_aux_c_cma_1 ds_cma,ds_cma2;
    bool bo_ret;
	bool bo_resize;

//    char ch_enc;

    memset(&ds_cma,0,sizeof(ds_cma));
	memset(&ds_cma2,0,sizeof(ds_cma2));
    
    if (ads_cmd->im_numparam!=2)
    {    
            PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_setsize(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
            SDH_EXIT;
    }

    if ((ads_cmd->imr_parlen[1])!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_setsize(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }
	
	ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
	ds_cma.iec_chs_name=ied_chs_ansi_819;
	ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
	ds_cma.iec_ccma_def=ied_ccma_query;
	ds_cma.inc_len_cma_area=-1;
		
	bo_resize=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
								DEF_AUX_COM_CMA,
								&ds_cma,
								sizeof(ds_cma));
	if (bo_resize==true)
	{
		//acquire lock 
		ds_cma2.ac_cma_name=&ads_cmd->chrr_par[0][0];
		ds_cma2.iec_chs_name=ied_chs_ansi_819;
		ds_cma2.inc_len_cma_name=ads_cmd->imr_parlen[0];
		ds_cma2.iec_ccma_def=ied_ccma_lock_global;
		ds_cma2.inc_lock_disp=0;
		ds_cma2.inc_lock_len=0;
		ds_cma2.imc_lock_type=D_CMA_ALL_ACCESS;
		ds_cma2.boc_ret_lock_fails=true;
		bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
									DEF_AUX_COM_CMA,
									&ds_cma2,
									sizeof(ds_cma2));
		if (bo_ret==false)
		{
			PRINT_DIRECT("SDH_WSP_TEST:  m_proc_cma_setsize(): Failed to set global lock!\n");
			SDH_EXIT;
		}
	}

    ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
    ds_cma.iec_chs_name=ied_chs_ansi_819;
    ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
    ds_cma.iec_ccma_def=ied_ccma_set_size;
    ds_cma.inc_len_cma_area=(int)m_getpar_uint32(ads_cmd,1);
        
    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_SETSIZE size=%d, ret=%d\r\n",ds_cma.inc_len_cma_area,(bo_ret&0x01));
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);



	if (bo_resize==true)
	{
		//release lock
		ds_cma2.iec_ccma_def=ied_ccma_lock_release;
		bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
							DEF_AUX_COM_CMA,
							&ds_cma2,
							sizeof(ds_cma2));
		if (bo_ret==false)
		{
			PRINT_DIRECT("SDH_WSP_TEST:  m_proc_cma_setsize(): Failed to release global lock!\n");
			SDH_EXIT;
		}
	}
}


void m_proc_cma_read(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_hl_aux_c_cma_1 ds_cma;
    char ch_ret=0;
    bool bo_ret;
    //char ch_enc;
    int im_offset;
    int im_len;
    memset(&ds_cma,0,sizeof(ds_cma));
    

    if(ads_cmd->im_numparam!=3)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_read(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    if (ads_cmd->imr_parlen[1]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_read(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }
    
    if (ads_cmd->imr_parlen[2]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_read(): Invalid parameter size(2): %d\r\n",ads_cmd->imr_parlen[2]);
        SDH_EXIT;
    }


    im_offset=m_getpar_uint32(ads_cmd,1);
    im_len=m_getpar_uint32(ads_cmd,2);

    if (im_offset<0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_read(): Invalid parameter value (1): %d\r\n",im_offset);
        SDH_EXIT;
    }
    if ((im_len<0)||(im_len>MAX_CMD_PARAM_LEN))
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_read(): Invalid parameter value (2): %d\r\n",im_len);
        SDH_EXIT;
    }
    ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
    ds_cma.iec_chs_name=ied_chs_ansi_819;
    ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
    ds_cma.iec_ccma_def=ied_ccma_query;
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ offset=%d, len=%d\r\n",im_offset,im_len);
    }

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
    if (bo_ret==true)
    {
        if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
        {
            PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ: cma query successful!\r\n");
        }

        //acquire read lock 
        ds_cma.iec_ccma_def=ied_ccma_lock_region;
        ds_cma.inc_lock_disp=im_offset;
        ds_cma.inc_lock_len=im_len;
        ds_cma.imc_lock_type=D_CMA_READ_DATA|D_CMA_SHARE_READ;
        ds_cma.boc_ret_lock_fails=true;
        bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
        if ((bo_ret==true)&&(ds_cma.achc_cma_area!=NULL))
        {
            if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ: set read lock successful!\r\n");
            }

            //read data
            memcpy(&ads_cmd->chrr_par[1][0],ds_cma.achc_cma_area+im_offset,im_len);
            
            //release read lock
            ds_cma.iec_ccma_def=ied_ccma_lock_release;
            bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
            if (bo_ret==true)
            {
                if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
                {
                    PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ: release read lock successful!\r\n");
                }
            }
            else
            {
                if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
                {
                    PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ: release read lock failed!\r\n");
                }
                ch_ret=3;
            }
        }
        else
        {
            if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ: set read lock failed!\r\n");
            }
            ch_ret=2;
        }
    }
    else
    {
        if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
        {
            PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_READ: cma query failed!\r\n");
        }
        ch_ret=1;
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_byte(ads_cmd,0,ch_ret);
    if (ch_ret==0)
    {
        //success
        ads_cmd->imr_parlen[1]=im_len;
    }
    else
    {
        //fail
        ads_cmd->imr_parlen[1]=0;
    }
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);

}

void m_proc_cma_write(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_hl_aux_c_cma_1 ds_cma;
    char ch_ret=0;
    bool bo_ret;
    //char ch_enc;
    int im_offset;
    
    memset(&ds_cma,0,sizeof(ds_cma));
    
    if(ads_cmd->im_numparam!=3)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_write(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[1]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_write(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    if (ads_cmd->imr_parlen[2]>MAX_CMD_PARAM_LEN)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_write(): Invalid parameter size(2): %d\r\n",ads_cmd->imr_parlen[2]);
        SDH_EXIT;
    }

    im_offset=m_getpar_uint32(ads_cmd,1);
    
    
    ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
    ds_cma.iec_chs_name=ied_chs_ansi_819;
    ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
    ds_cma.iec_ccma_def=ied_ccma_query;
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE offset=%d, len=%d\r\n",im_offset,ads_cmd->imr_parlen[2]);
    }

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
    if (bo_ret==true)
    {
        if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
        {
            PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE: cma query successful!\r\n");
        }

        //acquire write lock 
        ds_cma.iec_ccma_def=ied_ccma_lock_region;
        ds_cma.inc_lock_disp=im_offset;
        ds_cma.inc_lock_len=ads_cmd->imr_parlen[2];
        ds_cma.imc_lock_type=D_CMA_WRITE_DATA;
        ds_cma.boc_ret_lock_fails=true;
        bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
        if ((bo_ret==true)&&(ds_cma.achc_cma_area!=NULL))
        {
            if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE: set write lock successful!\r\n");
            }
            memcpy(ds_cma.achc_cma_area+im_offset,&ads_cmd->chrr_par[2][0],ads_cmd->imr_parlen[2]);

            //release write lock
            ds_cma.iec_ccma_def=ied_ccma_lock_rel_upd;
            bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
            if (bo_ret==true)
            {
                if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
                {
                    PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE: release write lock successful!\r\n");
                }
            }
            else
            {
                if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
                {
                    PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE: release write lock failed!\r\n");
                }
                ch_ret=3;
            }
            
        }
        else
        {
            if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE: set write lock failed!\r\n");
            }
            ch_ret=2;
        }
    }
    else
    {
        if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
        {
            PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_WRITE: cma query failed!\r\n");
        }
        ch_ret=1;
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_byte(ads_cmd,0,ch_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);

}



void m_proc_cma_lock_global(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_clib1_sesscfg* ads_settings;
    struct dsd_hl_aux_c_cma_1 ds_cma;
    char ch_ret=-1;
    bool bo_ret;
    //char ch_enc;
    int im_acc;

    ads_settings=(struct dsd_clib1_sesscfg*)adsp_hl_clib_1->ac_conf;    
    memset(&ds_cma,0,sizeof(ds_cma));
    
    if(ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_lock_global(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[1]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_lock_global(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    im_acc=m_getpar_uint32(ads_cmd,1);
    ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
    ds_cma.iec_chs_name=ied_chs_ansi_819;
    ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
    ds_cma.iec_ccma_def=ied_ccma_query;
        
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_GLOBAL access=%d\r\n",im_acc);
    }

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
    if (bo_ret==true)
    {
        if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
        {
            PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_GLOBAL: cma query successful!\r\n");
        }

        //acquire lock 
        ds_cma.iec_ccma_def=ied_ccma_lock_global;
        ds_cma.inc_lock_disp=0;
        ds_cma.inc_lock_len=0;
        ds_cma.imc_lock_type=im_acc;
        ds_cma.boc_ret_lock_fails=true;
        bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
        if (bo_ret==true)
        {
            if (ds_cma.achc_cma_area==NULL)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMA address is NULL!\r\n");
                SDH_EXIT;
            }
            if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_GLOBAL: set persistent lock successful!\r\n");
            }
            ads_settings->ch_lockstate=LOCK_STATE_LOCKED;
            
            while((ads_settings->ch_lockstate&LOCK_STATE_STOP)==0)
            {
                SLEEP_SECONDS(1);
            }
            
            ds_cma.iec_ccma_def=ied_ccma_lock_rel_upd;
            bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
            if (bo_ret==true)
            {
                if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
                {
                    PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_GLOBAL: release lock successful!\r\n");
                }
                ch_ret=0; // SUCCESS
            }
            else
            {
                ch_ret=3; // CMA LOCK RELEASE FAILED
            }
        }
        else
        {
            ch_ret=2; // CMA LOCK FAILED
        }
    }
    else
    {
        ch_ret=1; // CMA NOT FOUND
    }

    ads_settings->ch_lockstate=0;
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_byte(ads_cmd,0,(unsigned char) ch_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_cma_lock_region(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_clib1_sesscfg* ads_settings;
    struct dsd_hl_aux_c_cma_1 ds_cma;
    char ch_ret=-1;
    bool bo_ret;
    //char ch_enc;
    int im_acc;
    int im_offset;
    int im_len;

    ads_settings=(struct dsd_clib1_sesscfg*)adsp_hl_clib_1->ac_conf;    
    memset(&ds_cma,0,sizeof(ds_cma));
    
    if(ads_cmd->im_numparam!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_lock_region(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[1]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_lock_region(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[2]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_lock_region(): Invalid parameter size(2): %d\r\n",ads_cmd->imr_parlen[2]);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[3]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_lock_region(): Invalid parameter size(3): %d\r\n",ads_cmd->imr_parlen[3]);
        SDH_EXIT;
    }

    im_offset=m_getpar_uint32(ads_cmd,1);
    im_len=m_getpar_uint32(ads_cmd,2);
    im_acc=m_getpar_uint32(ads_cmd,3);
    ds_cma.ac_cma_name=&ads_cmd->chrr_par[0][0];
    ds_cma.iec_chs_name=ied_chs_ansi_819;
    ds_cma.inc_len_cma_name=ads_cmd->imr_parlen[0];
    ds_cma.iec_ccma_def=ied_ccma_query;
        
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_REGION offset=%d len=%d access=%d\r\n",im_offset,im_len,im_acc);
    }

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
    if (bo_ret==true)
    {
        if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
        {
            PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_REGION: cma query successful!\r\n");
        }

        //acquire lock 
        ds_cma.iec_ccma_def=ied_ccma_lock_region;
        ds_cma.inc_lock_disp=im_offset;
        ds_cma.inc_lock_len=im_len;
        ds_cma.imc_lock_type=im_acc;
        ds_cma.boc_ret_lock_fails=true;
        bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
    
        if (bo_ret==true)
        {
            if (ds_cma.achc_cma_area==NULL)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMA address is NULL!\r\n");
                SDH_EXIT;
            }
            if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
            {
                PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_REGION: set persistent lock successful!\r\n");
            }
            ads_settings->ch_lockstate=LOCK_STATE_LOCKED;
            
            while((ads_settings->ch_lockstate&LOCK_STATE_STOP)==0)
            {
                SLEEP_SECONDS(1);
            }
            
            ds_cma.iec_ccma_def=ied_ccma_lock_rel_upd;
            bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_COM_CMA,
                                &ds_cma,
                                sizeof(ds_cma));
            if (bo_ret==true)
            {
                if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
                {
                    PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_LOCK_REGION: release lock successful!\r\n");
                }
                ch_ret=0; // SUCCESS
            }
            else
            {
                ch_ret=3; // CMA LOCK RELEASE FAILED
            }
        }
        else
        {
            ch_ret=2; // CMA LOCK FAILED
        }
    }
    else
    {
        ch_ret=1; // CMA NOT FOUND
    }

    ads_settings->ch_lockstate=0;
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_byte(ads_cmd,0,(unsigned char) ch_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_cma_get_lock_state(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_clib1_sesscfg* ads_settings;
    ads_settings=(struct dsd_clib1_sesscfg*)adsp_hl_clib_1->ac_conf;
    if (ads_cmd->im_numparam!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_get_lock_state(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_GET_LOCK_STATE: ret=%d\r\n",(ads_settings->ch_lockstate)&0xFF);
    }
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_byte(ads_cmd,0,(unsigned)ads_settings->ch_lockstate);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_cma_set_lock_state(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_clib1_sesscfg* ads_settings;
    ads_settings=(struct dsd_clib1_sesscfg*)adsp_hl_clib_1->ac_conf;    
    if (ads_cmd->im_numparam!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_cma_set_lock_state(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    ads_settings->ch_lockstate=m_getpar_byte(ads_cmd,0);

    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_CMA_SET_LOCK_STATE: state=%d\r\n",(ads_settings->ch_lockstate)&0xFF);
    }
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=0;
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_get_random(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    int im_len;
    bool bo_ret;
    char chr_rnd[256];

    if (ads_cmd->im_numparam!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_get_random(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    im_len=(unsigned char) m_getpar_byte(ads_cmd,0);

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_RANDOM_BASE64,
                                (void *)chr_rnd,
                                im_len);

    if (bo_ret==false)
    {
        strcpy(chr_rnd,"");
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_bool(ads_cmd,0,bo_ret);
    memcpy(&ads_cmd->chrr_par[1][0],chr_rnd,im_len);
    ads_cmd->imr_parlen[1]=im_len;
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_tcp_conn(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
	struct dsd_unicode_string ads_ustr;
    char chr_ineta[MAX_CMD_PARAM_LEN+1];

    struct dsd_aux_tcp_conn_1 ds_tcp;
    //struct dsd_clib1_sesscfg *ads_session;
    bool bo_ret;
    
	if (ads_cmd->im_numparam!=3)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_tcp_conn(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    memset(chr_ineta,0,sizeof(chr_ineta));
    memset(&ds_tcp,0,sizeof(ds_tcp));

    if (ads_cmd->imr_parlen[0]>0)
    {
        memcpy(chr_ineta,&ads_cmd->chrr_par[0][0],ads_cmd->imr_parlen[0]);
		ds_tcp.dsc_target_ineta.ac_str=chr_ineta;
	}
	else
	{
		ds_tcp.dsc_target_ineta.ac_str=NULL;
    }

	ds_tcp.dsc_target_ineta.iec_chs_str=(ied_charset)m_getpar_byte(ads_cmd,1);
	ds_tcp.dsc_target_ineta.imc_len_str=ads_cmd->imr_parlen[0];	
	ds_tcp.imc_server_port=(int)m_getpar_uint16(ads_cmd,2);	
	ds_tcp.dsc_aux_tcp_def.ibc_ssl_client=0;


    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_TCP_CONN,
                                &ds_tcp,
                                sizeof(ds_tcp));
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_TCP_CONN: ret=%d state=%d\r\n",bo_ret&0x01,(ds_tcp.iec_tcpconn_ret&0xFF));
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_setpar_byte(ads_cmd,1,(unsigned char)ds_tcp.iec_tcpconn_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_tcp_conn_ssl(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
	struct dsd_unicode_string ads_ustr;
    char chr_ineta[MAX_CMD_PARAM_LEN+1];

    struct dsd_aux_tcp_conn_1 ds_tcp;
    //struct dsd_clib1_sesscfg *ads_session;
    bool bo_ret;
    
	if (ads_cmd->im_numparam!=3)
    {
		PRINT_DIRECT("SDH_WSP_TEST: m_proc_tcp_conn_ssl(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    memset(chr_ineta,0,sizeof(chr_ineta));
    memset(&ds_tcp,0,sizeof(ds_tcp));

    if (ads_cmd->imr_parlen[0]>0)
    {
        memcpy(chr_ineta,&ads_cmd->chrr_par[0][0],ads_cmd->imr_parlen[0]);
		ds_tcp.dsc_target_ineta.ac_str=chr_ineta;
	}
	else
	{
		ds_tcp.dsc_target_ineta.ac_str=NULL;
    }

	ds_tcp.dsc_target_ineta.iec_chs_str=(ied_charset)m_getpar_byte(ads_cmd,1);
	ds_tcp.dsc_target_ineta.imc_len_str=ads_cmd->imr_parlen[0];	
	ds_tcp.imc_server_port=(int)m_getpar_uint16(ads_cmd,2);	
    ds_tcp.dsc_aux_tcp_def.ibc_ssl_client=1;


    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_TCP_CONN,
                                &ds_tcp,
                                sizeof(ds_tcp));
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_TCP_CONN_SSL: ret=%d state=%d\r\n",bo_ret&0x01,(ds_tcp.iec_tcpconn_ret&0xFF));
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_setpar_byte(ads_cmd,1,(unsigned char)ds_tcp.iec_tcpconn_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}


void m_proc_tcp_close(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    bool bo_ret;

    if (ads_cmd->im_numparam!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_tcp_close(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_TCP_CLOSE,
                                NULL,
                                0);    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_TCP_CLOSE: ret=%d\r\n",bo_ret&0x01);
    }
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_diskfile_access(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    BOOL bo_ret;
    struct dsd_hl_aux_diskfile_1 ds_file;
    unsigned long long ull_addr_start,ull_addr_end,ull_addr_df1;
    unsigned int um_time;
    //char chr_fileinfo[28]; // 8 byte start addr, 8 byte end addr, 4 byte last_mod, 8 byte ads_int_df1;
    //int in_lastmodtime;
    

    if(ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_access(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    if (ads_cmd->imr_parlen[1]!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_access(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    ds_file.ac_name=&ads_cmd->chrr_par[0][0];
    ds_file.iec_chs_name=(ied_charset)m_getpar_byte(ads_cmd,1);
    ds_file.inc_len_name=ads_cmd->imr_parlen[0];

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_DISKFILE_ACCESS,
                                &ds_file,
                                sizeof(ds_file));

    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_DISKFILE_ACCESS: ret=%d\r\n",bo_ret&0x01);
    }

    ull_addr_start=0;
    ull_addr_end=0;
    ull_addr_df1=0;
    um_time=0;
    if (bo_ret!=false)
    {
        if (ds_file.iec_dfar_def==ied_dfar_ok)
        {
            ull_addr_start=(unsigned long long)ds_file.adsc_int_df1->achc_filecont_start;
            ull_addr_end=(unsigned long long)ds_file.adsc_int_df1->achc_filecont_end;
            ull_addr_df1=(unsigned long long)ds_file.adsc_int_df1;
        }
        um_time=ds_file.imc_time_last_mod;
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=4;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_setpar_byte(ads_cmd,1,ds_file.iec_dfar_def);
    m_setpar_uint64(ads_cmd,2,(unsigned long long)ds_file.ac_handle);
    m_setpar_fileinfo(ads_cmd,3,ull_addr_start,ull_addr_end,um_time,ull_addr_df1);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_diskfile_release(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    BOOL bo_ret;
    unsigned long long ull_handle;
    unsigned long ul_handle;
    void *avo_addr;

    if(ads_cmd->im_numparam!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_release(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    if (ads_cmd->imr_parlen[0]!=8)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_release(): Invalid parameter size(0): %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }

    ull_handle=m_getpar_uint64(ads_cmd,0);
    ul_handle=(unsigned long) ull_handle;

    switch(sizeof(void *))
    {
        case(4):    avo_addr=&ul_handle;
                    break;
        case(8):    avo_addr=&ull_handle;
                    break;
        default:    PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_release(): Internal Error!\r\n");
                    SDH_EXIT;
    }

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_DISKFILE_RELEASE,
                                avo_addr,
                                sizeof(void *));

    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_DISKFILE_ACCESS: handle=%p ret=%d\r\n",(void *)ull_handle,bo_ret&0x01);
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_diskfile_time_lm(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    BOOL bo_ret_time;
    struct dsd_hl_aux_diskfile_1 ds_file;
    unsigned int um_time=0;

    memset(&ds_file,0,sizeof(ds_file));
    bo_ret_time=false;
    
    if(ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_time_lm(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    if (ads_cmd->imr_parlen[1]!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_diskfile_time_lm(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    ds_file.ac_name=&ads_cmd->chrr_par[0][0];
    ds_file.iec_chs_name=(ied_charset)m_getpar_byte(ads_cmd,1);
    ds_file.inc_len_name=ads_cmd->imr_parlen[0];

    
    bo_ret_time=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_DISKFILE_TIME_LM,
                                &ds_file,
                                sizeof(ds_file));
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_DISKFILE_TIME_LM: ret=%d\r\n",bo_ret_time&0x01);
    }

    um_time=(unsigned)ds_file.imc_time_last_mod;

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=3;
    m_setpar_bool(ads_cmd,0,bo_ret_time);
    m_setpar_byte(ads_cmd,1,ds_file.iec_dfar_def);
    m_setpar_uint32(ads_cmd,2,um_time);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_string_from_epoch(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_hl_aux_epoch_1 ds_epoch;
    char chr_time[1024];
    BOOL bo_ret;
    
    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_string_from_epoch(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[0]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_string_from_epoch(): Invalid parameter size(0): %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[1]!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_string_from_epoch(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }
    memset(&ds_epoch,0,sizeof(ds_epoch));
    ds_epoch.ac_epoch_str=&chr_time[0];
    ds_epoch.imc_epoch_val=(int)m_getpar_uint32(ads_cmd,0);
    ds_epoch.iec_chs_epoch=(ied_charset)m_getpar_byte(ads_cmd,1);
    ds_epoch.inc_len_epoch=sizeof(chr_time);
    if (ds_epoch.iec_chs_epoch>3)ds_epoch.inc_len_epoch=ds_epoch.inc_len_epoch/2; //UTF-16
    if (ds_epoch.iec_chs_epoch>6)ds_epoch.inc_len_epoch=ds_epoch.inc_len_epoch/2; //UTF-32

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_STRING_FROM_EPOCH,
                                &ds_epoch,
                                sizeof(ds_epoch));

    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_STRING_FROM_EPOCH: ret=%d epoch=%u\r\n",bo_ret&0x01,ds_epoch.imc_epoch_val);
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_bool(ads_cmd,0,bo_ret);
    if (bo_ret!=false)
    {
        ads_cmd->imr_parlen[1]=strlen(chr_time);
        memcpy(&ads_cmd->chrr_par[1][0],chr_time,strlen(chr_time));
    }
    else
    {
        ads_cmd->imr_parlen[1]=4;
        memset(&ads_cmd->chrr_par[1][0],0,4);
    }
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_epoch_from_string(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_hl_aux_epoch_1 ds_epoch;
    //char chr_time[1024];
    BOOL bo_ret;
    
    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_epoch_from_string(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[0]<=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_epoch_from_string(): Invalid parameter size(0): %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[1]!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_epoch_from_string(): Invalid parameter size(1): %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }
    memset(&ds_epoch,0,sizeof(ds_epoch));
    ds_epoch.imc_epoch_val=0;
    ds_epoch.ac_epoch_str=&ads_cmd->chrr_par[0][0];
    ds_epoch.iec_chs_epoch=(ied_charset)m_getpar_byte(ads_cmd,1);
    ds_epoch.inc_len_epoch=ads_cmd->imr_parlen[0];
    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_EPOCH_FROM_STRING,
                                &ds_epoch,
                                sizeof(ds_epoch));
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_EPOCH_FROM_STRING: ret=%d epoch=%u\r\n",bo_ret&0x01,ds_epoch.imc_epoch_val);
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_setpar_uint32(ads_cmd,1,(unsigned)ds_epoch.imc_epoch_val);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_query_main_str(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    void *avo_name;
    int im_len=0;
    BOOL bo_ret;

    if (ads_cmd->im_numparam!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_query_main_str(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_QUERY_MAIN_STR,
                                &avo_name,
                                sizeof(void*));
    
    if ((us_tracelvl&TRACE_CMD_SIMPLE)!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: CMD_QUERY_MAIN_STR: ret=%d string=%s\r\n",bo_ret&0x01,(char *)avo_name);
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    if (bo_ret!=false)
    {
        im_len=strlen((char *)avo_name);
        memcpy(&ads_cmd->chrr_par[0][0],avo_name,im_len);
    }
    ads_cmd->imr_parlen[0]=im_len;
    m_setpar_bool(ads_cmd,1,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}


void m_proc_query_client(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    struct dsd_aux_query_client ds_query;
    bool bo_ret;

    memset(&ds_query,0,sizeof(ds_query));

    bo_ret=adsp_hl_clib_1->amc_aux(adsp_hl_clib_1->vpc_userfld,
                                DEF_AUX_QUERY_CLIENT,
                                &ds_query,
                                sizeof(ds_query));
    if (ads_cmd->im_numparam!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_query_main_str(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=4;
    m_setpar_uint32(ads_cmd,0,ds_query.inc_addr_family);
    ads_cmd->imr_parlen[1]=32;
    memcpy(&ads_cmd->chrr_par[1][0],&ds_query.chrc_multih_ineta[0],sizeof(ds_query.chrc_multih_ineta));
    memcpy(&ads_cmd->chrr_par[1][16],&ds_query.chrc_client_ineta[0],sizeof(ds_query.chrc_client_ineta));
    m_setpar_uint32(ads_cmd,2,ds_query.inc_port);
    m_setpar_bool(ads_cmd,3,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_crt_fileopen(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    FILE *ads_fd;
    unsigned long long ull_handle;
    
    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_fileopen(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }

    ads_fd=fopen(&ads_cmd->chrr_par[0][0],&ads_cmd->chrr_par[1][0]);

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    ull_handle=(unsigned long long)ads_fd;
    m_setpar_uint64(ads_cmd,0,ull_handle);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_crt_fileclose(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    FILE *ads_fd;
    unsigned long long ull_handle;
    int in_ret;

    if (ads_cmd->im_numparam!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_fileclose(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    ull_handle=m_getpar_uint64(ads_cmd,0);
    ads_fd=(FILE *)ull_handle;
    in_ret=fclose(ads_fd);
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_uint32(ads_cmd,0,(unsigned int)in_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_crt_fileread(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    FILE *ads_fd;
    unsigned long long ull_handle;
    size_t ds_size;
    size_t ds_ret;

    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_fileread(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    
    if (ads_cmd->imr_parlen[0]!=8)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_fileread(): Invalid handle size: %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }

    ull_handle=m_getpar_uint64(ads_cmd,0);
    ads_fd=(FILE *)ull_handle;
    

    if (ads_cmd->imr_parlen[1]!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_fileread(): Invalid read count size: %d\r\n",ads_cmd->imr_parlen[1]);
        SDH_EXIT;
    }

    ds_size=(size_t)m_getpar_uint16(ads_cmd,1);
    
    if ((ds_size<1)||(ds_size>MAX_CMD_PARAM_LEN))
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_fileread(): Invalid number of bytes to read: %d\r\n",ds_size);
        SDH_EXIT;
    }

    ds_ret=fread(&ads_cmd->chrr_par[1][0],1,ds_size,ads_fd);

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=2;
    m_setpar_uint32(ads_cmd,0,(unsigned int)ds_ret);
    ads_cmd->imr_parlen[1]=(int)ds_size;
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_crt_filewrite(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    FILE *ads_fd;
    unsigned long long ull_handle;
    size_t ds_size;
    size_t ds_ret;

    if (ads_cmd->im_numparam!=2)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_filewrite(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    
    if (ads_cmd->imr_parlen[0]!=8)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_filewrite(): Invalid handle size: %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }

    ull_handle=m_getpar_uint64(ads_cmd,0);
    ads_fd=(FILE *)ull_handle;
    
    ds_size=(size_t)ads_cmd->imr_parlen[1];
    if (ds_size>MAX_CMD_PARAM_LEN)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_filewrite(): Invalid data size: %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }
    ds_ret=fwrite(&ads_cmd->chrr_par[1][0],1,ds_size,ads_fd);

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_uint32(ads_cmd,0,(unsigned int)ds_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}

void m_proc_crt_filedelete(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    int in_ret;

    if (ads_cmd->im_numparam!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_crt_filedelete(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    
    in_ret=remove(&ads_cmd->chrr_par[0][0]);

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_uint32(ads_cmd,0,(unsigned int)in_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}


void m_proc_disconnect(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    if (ads_cmd->im_numparam!=1)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_disconnect(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    if (ads_cmd->imr_parlen[0]!=4)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_disconnect(): Invalid parameter size(0): %d\r\n",ads_cmd->imr_parlen[0]);
        SDH_EXIT;
    }

    adsp_hl_clib_1->inc_return=(int)m_getpar_uint32(ads_cmd,0);
    PRINT_DIRECT("SDH_WSP_TEST: m_proc_disconnect(): inc_return= %d\r\n",adsp_hl_clib_1->inc_return);
        
    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=0;
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}



void m_proc_tcp_get_status(struct dsd_hl_clib_1 *adsp_hl_clib_1,struct dsd_cmd *ads_cmd)
{
    bool bo_ret;
    struct dsd_clib1_sesspar* ads_session;
    ads_session=(struct dsd_clib1_sesspar*)adsp_hl_clib_1->ac_ext;
    
    if (ads_cmd->im_numparam!=0)
    {
        PRINT_DIRECT("SDH_WSP_TEST: m_proc_tcp_get_status(): Invalid number of parameters: %d\r\n",ads_cmd->im_numparam);
        SDH_EXIT;
    }
    bo_ret=(ads_session->bo_connected);

    ads_cmd->us_cmd|=0x8000;
    ads_cmd->im_numparam=1;
    m_setpar_bool(ads_cmd,0,bo_ret);
    m_sendcmd(adsp_hl_clib_1,ads_cmd,DIR_TOCLIENT);
}


    
