/* Tabelle ASCII -> ASCII UPPER */
/********************************************************************
***                                                               ***
***               Convert to UPPER Page Code 850                  ***
***                                                               ***
********************************************************************/

static unsigned char tabaau[256] = {

/*       0    1    2    3    4    5    6    7         */
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,      /* 0  */


/*       8    9    A    B    C    D    E    F         */
        0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x1F,      /* 0  */
/*                                          SU        */

/*       0    1    2    3    4    5    6    7         */
        0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,      /* 1	*/
/*                                                   */

/*       8    9    A    B    C    D    E    F         */
        0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,      /* 1  */
/*                                                    */

/*       0    1    2    3    4    5    6    7         */
        0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,      /* 2	*/
/*      SPC   !    "    #    $    %    &    '         */

/*       8    9    A    B    C    D    E    F         */
        0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,      /* 2	*/
/*       (    )    *    +    ,    -    .    /         */

/*       0    1    2    3    4    5    6    7         */
        0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,      /* 3	*/
/*      '0'  '1'  '2'  '3'  '4'  '5'  '6'  '7'        */

/*       8    9    A    B    C    D    E    F         */
        0x38,0x39,0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,      /* 3  */
/*      '8'  '9'   :    ;    <    =    >    ?         */

/*       0    1    2    3    4    5    6    7         */
        0x40,0x41,0x42,0x43,0x44,0x45,0x46,0x47,      /* 4  */
/*       @    A    B    C    D    E    F    G         */

/*       8    9    A    B    C    D    E    F         */
        0x48,0x49,0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,      /* 4  */
/*       H    I    J    K    L    M    N    O         */

/*       0    1    2    3    4    5    6    7         */
        0x50,0x51,0x52,0x53,0x54,0x55,0x56,0x57,      /* 5  */
/*       P    Q    R    S    T    U    V    W         */

/*       8    9    A    B    C    D    E    F         */
        0x58,0x59,0x5A,0x5B,0x5C,0x5D,0x5E,0x5F,      /* 5  */
/*       X    Y    Z    [    \    ]    ^    _         */

/*       0    1    2    3    4    5    6    7         */
        0x60,0x41,0x42,0x43,0x44,0x45,0x46,0x47,      /* 6  */
/*       `    a    b    c    d    e    f    g         */

/*       8    9    A    B    C    D    E    F         */
        0x48,0x49,0x4A,0x4B,0x4C,0x4D,0x4E,0x4F,      /* 6  */
/*       h    i    j    k    l    m    n    o         */

/*       0    1    2    3    4    5    6    7         */
        0x50,0x51,0x52,0x53,0x54,0x55,0x56,0x57,      /* 7  */
/*       p    q    r    s    t    u    v    w         */

/*       8    9    A    B    C    D    E    F         */
        0x58,0x59,0x5A,0x7B,0x7C,0x7D,0x7E,0x7F,      /* 7  */
/*       x    y    z    {    ≥    }    ~             */

/*       0    1    2    3    4    5    6    7         */
        0x80,0x9A,0x90,0xB6,0x8E,0xB7,0x8F,0x80,      /* 8  */
/*       Ä    Å    Ç    É    Ñ    Ö    Ü    á         */

/*       8    9    A    B    C    D    E    F         */
        0xD2,0xD3,0xD4,0xD8,0xD7,0xDE,0x8E,0x8F,      /* 8  */
/*       à    â    ä    ã    å    ç    é    è         */

/*       0    1    2    3    4    5    6    7         */
        0x90,0x92,0x92,0xE2,0x99,0xE3,0xEA,0xEB,      /* 9  */
/*       ê    ë    í    ì    î    ï    ñ    ó         */

/*       8    9    A    B    C    D    E    F         */
        0x98,0x99,0x9A,0x9B,0x9C,0x9D,0x9E,0x9F,      /* 9  */
/*       ò    ô    ö    Ì    ú    O/   x     ü        */

/*       0    1    2    3    4    5    6    7         */
        0xB5,0xD6,0xE0,0xE9,0xA5,0xA5,0xA6,0xA7,      /* A  */
/*       †    °    ¢    £    §    •    ¶    ß         */

/*       8    9    A    B    C    D    E    F         */
        0xA8,0xA9,0xAA,0xAB,0xAC,0xAD,0xAE,0xAF,      /* A  */
/*       ®    (R)  ™    ´    ¨    ≠    Æ    Ø         */

/*       0    1    2    3    4    5    6    7         */
        0xB0,0xB1,0xB2,0xB3,0xB4,0xB5,0xB6,0xB7,      /* B  */
/*       ∞    ±    ≤    ≥    ¥    A'   A^   A`        */

/*       8    9    A    B    C    D    E    F         */
        0xB8,0xB9,0xBA,0xBB,0xBC,0xBD,0xBE,0xBF,      /* B  */
/*       (C)  π    ∫    ª    º    õ    ù    ø )       */

/*       0    1    2    3    4    5    6    7         */
        0xC0,0xC1,0xC2,0xC3,0xC4,0xC5,0xC7,0xC7,      /* C  */
/*       ¿    ¡    ¬    √    ƒ    ≈    a~   A~        */

/*       8    9    A    B    C    D    E    F         */
        0xC8,0xC9,0xCA,0xCB,0xCC,0xCD,0xCE,0xCF,      /* C  */
/*       »    …         À    Ã    Õ    Œ             */

/*       0    1    2    3    4    5    6    7         */
        0xD0,0xD1,0xD2,0xD3,0xD4,0xD5,0xD6,0xD7,      /* D  */
/*       Î    -D   E^   E..  E`   ^1   I'   I^        */

/*       8    9    A    B    C    D    E    F         */
        0xD8,0xD9,0xDA,0xDB,0xDC,0xDD,0xDE,0xDF,      /* D  */
/*       I..  Ÿ    ⁄    €    ‹    |    I`   ﬂ .       */

/*       0    1    2    3    4    5    6    7         */
        0xE0,0xE1,0xE2,0xE3,0xE5,0xE5,0xE6,0xE7,      /* E  */
/*       O'   ·    O^   O`   o~   O~   Ê    b         */

/*       8    9    A    B    C    D    E    F         */
        0xE8,0xE9,0xEA,0xEB,0xED,0xED,0xEE,0xEF,      /* E  */
/*       b    U'   U^   U`   y'   Y'   ^-   '         */

/*       0    1    2    3    4    5    6    7         */
        0xF0,0xF1,0xF2,0xF3,0xF4,0xF5,0xF6,0xF7,      /* F  */
/*       -    Ò    =    3/4          ˆ    ,         */

/*       8    9    A    B    C    D    E    F         */
        0xF8,0xF9,0xFA,0xFB,0xFC,0xFD,0xFE,0xFF       /* F  */
/*       ¯    ..   ˙    ^1   ^3   ˝    ˛              */
};
